[
    {
      "tour": "Meeting at Hotel Lobby",
      "description": "Your guide will meet you at the lobby of your hotel to kickstart your full-day Ubud adventure."
    },
    {
      "tour": "Visit Sacred Monkey Forest Sanctuary",
      "description": "Explore the Sacred Monkey Forest Sanctuary, home to over 700 long-tailed macaques. Wander through lush greenery, ancient temples, and enjoy close encounters with playful monkeys."
    },
    {
      "tour": "Explore Ubud Traditional Market",
      "description": "Immerse yourself in the bustling atmosphere of Ubud Traditional Market. Browse through stalls offering local handicrafts, souvenirs, and fresh produce. Engage with local vendors and witness the vibrant culture of Ubud."
    },
    {
      "tour": "Lunch at a Local Warung",
      "description": "Indulge in a delicious lunch at a traditional warung (local eatery). Savor authentic Balinese cuisine while enjoying scenic views of Ubud's lush surroundings."
    },
    {
      "tour": "Visit Ubud Royal Palace (Puri Saren Agung)",
      "description": "Discover the rich history and architectural beauty of Ubud Royal Palace. Explore the intricate designs, traditional Balinese structures, and learn about the royal family's legacy."
    },
    {
      "tour": "Explore Ubud Art Market",
      "description": "Stroll through Ubud Art Market, known for its exquisite collection of Balinese art, crafts, and textiles. Browse through a variety of handmade items and support local artisans."
    },
    {
      "tour": "Enjoy Scenic Views at Tegalalang Rice Terraces",
      "description": "Experience the breathtaking beauty of Tegalalang Rice Terraces. Marvel at the intricate rice paddies sculpted into the hillsides and capture stunning photos of Ubud's iconic landscape."
    },
    {
      "tour": "Visit Ubud Monkey Forest",
      "description": "Conclude your day with a visit to Ubud Monkey Forest, a sanctuary for over 700 Balinese macaques. Explore ancient temples, lush vegetation, and encounter playful monkeys in their natural habitat."
    },
    {
      "tour": "Return to Hotel",
      "description": "After a full day of exploration and adventure, your guide will accompany you back to your hotel. Reflect on the day's experiences and cherish the memories of your Ubud tour."
    }
  ]
  